app/controllers/user/order_data_controller.rb

  def pve_suits
    pve_category = PveCategory.find(params[:pve_category_id].to_i)
    render :update do |page|
      page.replace_html("pve_suits_div", :partial => "pve_suits", :locals => {:pve_suits => pve_category.pve_suits, :checked => false})
      page.assign("pve_suits", pve_category.pve_suits.map {|suit| suit.attributes.except("created_at", "updated_at") })
---
SELECT * FROM `pve_suits` WHERE (`pve_suits`.pve_category_id = 2)

  def pve_time_price
    update_pve_session
    @pve_suits = PveSuit.find(session[:pve][:suits], :include => [:pve_category])
    @total_pve_price = @pve_suits.map(&:price).sum
    @pve_time_prices = PveTimePrice.find_by_price(@total_pve_price)
---
SELECT * FROM `pve_time_prices` WHERE (pve_price < 400.0)