app/controllers/user/orders_controller.rb

  def customize_pve
    if params[:level]
      session[:order] = (session[:order] || {}).update(:level => params[:level])
    end
    if params[:clear] == "pvp"
      session[:order][:pvp] = nil if session[:order]
    end
    @pve_categories = PveCategory.find(:all)
    @instances = Instance.find(:all)
    @min_pve_price = SystemConfig.find_by_name("pve_min_price").value
    if session[:order] && session[:order][:pve]
      if session[:order][:pve][:suits]
        @pve_suits = PveSuit.find(session[:order][:pve][:suits], :include => [:pve_category])
      end
      if session[:order][:pve][:equipment]
        @pve_equipment = Equipment.find(session[:order][:pve][:equipment])
      end
      if session[:order][:pve][:weapon]
        @pve_weapons = Equipment.find(session[:order][:pve][:weapons])
      end
      @total_pve_price = (@pve_suits || []).map(&:price).sum + (@pve_equipment || []).map(&:price).sum + (@pve_weapons || []).map(&:price).sum
      @pve_time_prices = PveTimePrice.find_by_price(@total_pve_price) if @total_pve_price > @min_pve_price.to_f
---
SELECT * FROM `pve_categories` WHERE (`pve_categories`.`id` IN (1,2))
SELECT * FROM `system_configs` WHERE (`system_configs`.`name` = 'pve_min_price') LIMIT 1
SELECT * FROM `pve_suits` WHERE (`pve_suits`.`id` IN (4,1))
SELECT * FROM `equipment` WHERE (`equipment`.`id` IN (1,4))
SELECT * FROM `pve_categories`
SELECT * FROM `pve_time_prices` WHERE (pve_price < 400.0)

  def customize_pvp
    if params[:pve]
      session[:order][:pve].update(params[:pve])
    end
    @pvp_categories = PvpCategory.find(:all)
    @instances = Instance.find(:all)
    @min_pvp_price = SystemConfig.find_by_name("pvp_min_price").value
    if session[:order] && session[:order][:pvp]
      if session[:order][:pvp][:suits]
        @pvp_suits = PvpSuit.find(session[:order][:pvp][:suits], :include => [:pvp_category])
      end
      if session[:order][:pvp][:weapon]
        @pvp_weapons = Equipment.find(session[:order][:pvp][:weapons])
      end
      @total_pvp_price = (@pvp_suits || []).map(&:price).sum + (@pvp_weapons || []).map(&:price).sum
      @pvp_time_prices = PvpTimePrice.find_by_price(@total_pvp_price) if @total_pvp_price > @min_pvp_price.to_f
---
SELECT * FROM `pvp_categories` WHERE (`pvp_categories`.`id` = 2)
SELECT * FROM `system_configs` WHERE (`system_configs`.`name` = 'pvp_min_price') LIMIT 1
SELECT * FROM `pvp_suits` WHERE (`pvp_suits`.`id` = 3)
SELECT * FROM `pvp_categories`
SELECT * FROM `pvp_time_prices` WHERE (pvp_price < 1000.0)

  def create
    find_order_data
    order = Order.new(params[:order].update(:order_status_id => 1, :total_price => @prices.sum))

    order.order_upgrade_level = OrderUpgradeLevel.new(:upgrade_level_id => @upgrade_level.id,
      :upgrade_level_price_id => @upgrade_level_price.id, :level_status_id => 1) if @upgrade_level && @upgrade_level_price

    order.pve_suits = @pve_suits || []
    order.pve_equipment = (@pve_equipment || []) + (@pve_weapons || [])
    order.order_pve_time_price = OrderPveTimePrice.new(:pve_time_price_id => @pve_time_price.id, :pve_status_id => 1) if @pve_time_price

    order.pvp_suits = @pvp_suits || []
    order.pvp_equipment = @pvp_weapons || []
    order.order_pvp_time_price = OrderPvpTimePrice.new(:pvp_time_price_id => @pvp_time_price.id, :pvp_status_id => 1) if @pvp_time_price

    order.save!
---
INSERT INTO `order_pve_time_prices` (`order_id`, `pve_status_id`, `pve_time_price_id`) VALUES(2, 1, 8)
INSERT INTO `order_pvp_time_prices` (`order_id`, `pvp_time_price_id`, `pvp_status_id`) VALUES(2, 5, 1)
INSERT INTO `order_upgrade_levels` (`order_id`, `level_status_id`, `upgrade_level_id`, `upgrade_level_price_id`) VALUES(2, 1, 2, 5)
INSERT INTO `orders_pve_equipment` (`order_id`, `equipment_id`) VALUES (2, 4)

  def pay
    @order = Order.find_by_order_code(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`order_code` = '2009072721443280') LIMIT 1

  def find_order_data
    redirect_to :action => "customize_level" and return false if session[:order].nil? || (session[:order][:level].nil? && session[:order][:pve].nil? && session[:order][:pvp].nil?)
    @prices = []
    if session[:order][:level]
      @upgrade_level = UpgradeLevel.find(session[:order][:level][:upgrade_level_id]) if session[:order][:level][:upgrade_level_id]
      @upgrade_level_price = UpgradeLevelPrice.find(session[:order][:level][:upgrade_level_price_id]) if session[:order][:level][:upgrade_level_price_id]
      @prices << @upgrade_level.price * @upgrade_level_price.factor if @upgrade_level && @upgrade_level_price
    end
    if session[:order][:pve]
      @pve_suits = PveSuit.find(session[:order][:pve][:suits]) unless session[:order][:pve][:suits].blank?
      @pve_equipment = Equipment.find(session[:order][:pve][:equipment]) unless session[:order][:pve][:equipment].blank?
      @pve_weapons = Equipment.find(session[:order][:pve][:weapons]) unless session[:order][:pve][:weapons].blank?
      @pve_time_price = PveTimePrice.find(session[:order][:pve]["pve_time_price_id"])
---
SELECT * FROM `upgrade_levels` WHERE (`upgrade_levels`.`id` = 2)
SELECT * FROM `upgrade_level_prices` WHERE (`upgrade_level_prices`.`id` = 5)
SELECT * FROM `pve_suits` WHERE (`pve_suits`.`id` = 4)
SELECT * FROM `pvp_suits` WHERE (`pvp_suits`.`id` = 3)
SELECT * FROM `equipment` WHERE (`equipment`.`id` = 4)
SELECT * FROM `pve_time_prices` WHERE (`pve_time_prices`.`id` = 8)
SELECT * FROM `pvp_time_prices` WHERE (`pvp_time_prices`.`id` = 6)