app/controllers/user/order_data_controller.rb

  def upgrade_level_times
    @upgrade_level = UpgradeLevel.find(params[:upgrade_level_id])
---
SELECT * FROM `upgrade_levels` WHERE (`upgrade_levels`.`id` = 2)

  def pve_suits
    pve_category = PveCategory.find(params[:pve_category_id].to_i)
---
SELECT * FROM `pve_categories` WHERE (`pve_categories`.`id` = 2)

  def pve_time_price
    update_pve_session
    @pve_suits = PveSuit.find(session[:order][:pve][:suits], :include => [:pve_category])
    @pve_equipment = Equipment.find(session[:order][:pve][:equipment])
    @pve_weapons = Equipment.find(session[:order][:pve][:weapons])
    @total_pve_price = @pve_suits.map(&:price).sum + @pve_equipment.map(&:price).sum + @pve_weapons.map(&:price).sum
    @pve_time_prices = PveTimePrice.find_by_price(@total_pve_price) if @total_pve_price > SystemConfig.find_by_name("pve_min_price").value.to_f
---
SELECT * FROM `pve_categories` WHERE (`pve_categories`.`id` IN (1,2))
SELECT * FROM `pve_suits` WHERE (`pve_suits`.`id` IN (4,1))
SELECT * FROM `equipment` WHERE (`equipment`.`id` IN (1,4))
SELECT * FROM `system_configs` WHERE (`system_configs`.`name` = 'pve_min_price') LIMIT 1

  def pve_equipment
    if params[:instance_id] && params[:type]
      equipment = Equipment.find_all_by_equipment_category_id_and_equipment_type_id_and_instance_id(Equipment::CATEGORY_PVE, params[:type].to_i, params[:instance_id].to_i)
    elsif params[:eq_name] && params[:type]
      equipment = Equipment.find_all_by_equipment_category_and_id_equipment_type_id(Equipment::CATEGORY_PVE, params[:type].to_i, :conditions => ["name like ?", "%#{params[:eq_name]}%"])
---
SELECT * FROM `equipment` WHERE (`equipment`.`instance_id` = 2 AND `equipment`.`equipment_category_id` = 1 AND `equipment`.`equipment_type_id` = 2)
SELECT * FROM `equipment` WHERE (name like '%装备%') AND (`equipment`.`equipment_type_id` = '1')

  def pvp_suits
    pvp_category = PvpCategory.find(params[:pvp_category_id].to_i)
---
SELECT * FROM `pvp_categories` WHERE (`pvp_categories`.`id` = 1)

  def pvp_time_price
    update_pvp_session
    @pvp_suits = PvpSuit.find(session[:order][:pvp][:suits], :include => [:pvp_category])
    @pvp_weapons = Equipment.find(session[:order][:pvp][:weapons])
    @total_pvp_price = @pvp_suits.map(&:price).sum + @pvp_weapons.map(&:price).sum
    @pvp_time_prices = PvpTimePrice.find_by_price(@total_pvp_price) if @total_pvp_price > SystemConfig.find_by_name("pvp_min_price").value.to_f
---
SELECT * FROM `pvp_categories` WHERE (`pvp_categories`.`id` IN (1,2))
SELECT * FROM `pvp_suits` WHERE (`pvp_suits`.`id` IN (1,3))
SELECT * FROM `system_configs` WHERE (`system_configs`.`name` = 'pvp_min_price') LIMIT 1

  def pvp_equipment
    if params[:instance_id]
      equipment = Equipment.find_all_by_equipment_category_id_and_equipment_type_id_and_instance_id(Equipment::CATEGORY_PVE, Equipment::TYPE_WEAPON, params[:instance_id].to_i)
---
SELECT * FROM `equipment` WHERE (`equipment`.`instance_id` = 1 AND `equipment`.`equipment_category_id` = 1 AND `equipment`.`equipment_type_id` = 2)

  def game_areas
    @game_areas = GameArea.find_all_by_game_id(params[:game_id])
---
SELECT * FROM `game_areas` WHERE (`game_areas`.`game_id` = '1') LIMIT 1

  def game_servers
    @game_servers = GameServer.find_all_by_game_area_id(params[:area_id])
---
SELECT * FROM `game_servers` WHERE (`game_servers`.`game_area_id` = '1')